-- This is an empty migration.
insert into public."UserPermission" ("id", "name", description, code, "parentId") values
(1, 'Раздел "Маркетинг"', 'Доступ к маккетингу в панели','PANEL_MARKETING', null),
(2, 'Опция "Страетгии"', 'Доступ к опции марктинга "Стратегии" в панели', 'PANEL_MARKETING_STRATEGY', 1),
(3, 'Опция "Каналы трафика"', 'Доступ к опции марктинга "Каналы трафика" в панели', 'PANEL_MARKETING_CHANNELS', 1),
(4, 'Опция "Результаты трафика"', 'Доступ к опции марктинга "Результаты трафика" в панели', 'PANEL_MARKETING_CHANNELS_PERFORMANCE', 1),
(5, 'Раздел "Проект"', 'Доступ к проектам в панели','PANEL_PROJECTS', null),
(6, 'Опция "Разработчику"', 'Доступ к опции проекта "Разработчику" в панели', 'PANEL_PROJECTS_DEVELOPER', 5),
(7, 'Опция "Апи ключи"', 'Доступ к опции проекта "Апи ключи" в панели', 'PANEL_PROJECTS_API_KEYS', 5),
(8, 'Опция "Пользователи"', 'Доступ к опции проекта "Пользователи" в панели', 'PANEL_PROJECTS_USERS', 5),
(9, 'Опция "Роли"', 'Доступ к опции проекта "Роли" в панели', 'PANEL_PROJECTS_ROLES', 5);


